# ДОМАШНЯЯ РАБОТА №1 (pandas)
### Требования к оформлению тетрадок прописаны в первой тетрадке учебных материалов.

### **Мягкий дедлайн: 6 октября.**
### **Жёсткий дедлайн: 11 октября.**
### После мягкого дедлайна за каждое задание можно получить только половину баллов. После жёсткого дедлайна работы не принимаются.


### **Критерии оценивания.** За каждую часть можно получить по 2 балла. 9/10 баллов можно получить только в том случае, если Вы не просто правильно выполните задания, но также построите графики и сделаете какие-то выводы на основе полученных результатов. Напишите, что кажется Вам закономерным/необычным. Какие ещё вопросы Вы бы задали к данным и как (предложите фреймворк кода)? Подумайте об ограничениях, особенностях данных и тд. 

### Удачи!

______________________________________________________________________________________________________________________________

### Вам предстоит проанализировать [датасет](https://www.kaggle.com/datasets/adilshamim8/educational-backgrounds-of-successful-people), содержащий сведения об образовании известных успешных людей.

## ЧАСТЬ 1: базовый анализ и очистка данных

#### Загрузите датасет и узнайте его размер, типы данных в столбцах.

In [386]:
#здесь я пытаюсь воспользоваться полученной с помощью нейросети инструкцией по тому, как установить в тетрадку kaggle, 
#но делаю это безуспешно, поэтому ниже пользуюсь классическим способом (просто загружаю файл через свой юпитер)
!pip install kaggle
!mkdir -p ~/.kaggle

Requirement already satisfied: kaggle in /opt/anaconda3/lib/python3.13/site-packages (1.7.4.5)
Requirement already satisfied: bleach in /opt/anaconda3/lib/python3.13/site-packages (from kaggle) (6.2.0)
Requirement already satisfied: certifi>=14.05.14 in /opt/anaconda3/lib/python3.13/site-packages (from kaggle) (2025.4.26)
Requirement already satisfied: charset-normalizer in /opt/anaconda3/lib/python3.13/site-packages (from kaggle) (3.3.2)
Requirement already satisfied: idna in /opt/anaconda3/lib/python3.13/site-packages (from kaggle) (3.7)
Requirement already satisfied: protobuf in /opt/anaconda3/lib/python3.13/site-packages (from kaggle) (5.29.3)
Requirement already satisfied: python-dateutil>=2.5.3 in /opt/anaconda3/lib/python3.13/site-packages (from kaggle) (2.9.0.post0)
Requirement already satisfied: python-slugify in /opt/anaconda3/lib/python3.13/site-packages (from kaggle) (5.0.2)
Requirement already satisfied: requests in /opt/anaconda3/lib/python3.13/site-packages (from kaggle) (2.32.3)
Requirement already satisfied: setuptools>=21.0.0 in /opt/anaconda3/lib/python3.13/site-packages (from kaggle) (72.1.0)
Requirement already satisfied: six>=1.10 in /opt/anaconda3/lib/python3.13/site-packages (from kaggle) (1.17.0)
Requirement already satisfied: text-unidecode in /opt/anaconda3/lib/python3.13/site-packages (from kaggle) (1.3)
Requirement already satisfied: tqdm in /opt/anaconda3/lib/python3.13/site-packages (from kaggle) (4.67.1)
Requirement already satisfied: urllib3>=1.15.1 in /opt/anaconda3/lib/python3.13/site-packages (from kaggle) (2.3.0)
Requirement already satisfied: webencodings in /opt/anaconda3/lib/python3.13/site-packages (from kaggle) (0.5.1)

In [444]:
import csv 
import pandas as pd
import numpy as np

In [445]:
df_succ_edu = pd.read_csv("successful_educations.csv")
df_succ_edu.info() #здесь мы получаем типы данных в столбцах, количество непропущенных значений в столбцах и размер файла в байтах

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 125 entries, 0 to 124
Data columns (total 10 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Name                       125 non-null    object
 1   Profession                 125 non-null    object
 2   Degree                     118 non-null    object
 3   Field                      117 non-null    object
 4   Institution                117 non-null    object
 5   Graduation Year            111 non-null    object
 6   Country                    124 non-null    object
 7   University Global Ranking  81 non-null     object
 8   GPA (or Equivalent)        86 non-null     object
 9   Scholarship/Award          88 non-null     object
dtypes: object(10)
memory usage: 9.9+ KB

In [446]:
df_succ_edu.shape #а здесь мы также можем узнать размер самой таблицы

(125, 10)

#### Найдите количество пропущенных значений в каждом столбце. Выведите первые 5 строк, последние 3 строки и 2 случайные строки, а также с 10 по 15 строки.

In [447]:
df_succ_edu.isna().sum() #находим пропущенные значения по колонкам

Name                          0
Profession                    0
Degree                        7
Field                         8
Institution                   8
Graduation Year              14
Country                       1
University Global Ranking    44
GPA (or Equivalent)          39
Scholarship/Award            37
dtype: int64

In [448]:
df_succ_edu.isnull().sum() #я как не понимала, так и не понимаю, в чем разница между этими двумя методами; но я знаю оба:)

Name                          0
Profession                    0
Degree                        7
Field                         8
Institution                   8
Graduation Year              14
Country                       1
University Global Ranking    44
GPA (or Equivalent)          39
Scholarship/Award            37
dtype: int64

In [449]:
df_succ_edu.head(5) #вывод 5 первых строк

,Name,Profession,Degree,Field,Institution,Graduation Year,Country,University Global Ranking,GPA (or Equivalent),Scholarship/Award
0,Elon Musk,Entrepreneur,Bachelor of Science,Physics & Economics,University of Pennsylvania,1997,USA,13,3.7,Dean’s List
1,Bill Gates,Entrepreneur,Dropped Out,computer science,Harvard University,1975,USA,5,NaN,Dean’s List
2,Sundar Pichai,Tech Executive,Master of Science,Material Sciences and Engineering,Stanford University,1995,USA,3,3.8,Fellowship in Engineering
3,Sheryl Sandberg,Tech Executive,Master of Business Administration,Business Administration,Harvard Business School,1995,USA,2,3.9,Hoover Fellowship
4,Jeff Bezos,Entrepreneur,Bachelor of Science,Computer Science and Electrical Engineering,Princeton University,1986,USA,16,3.6,Marquis Scholar

In [450]:
df_succ_edu.sample(2) #вывод 2 случайных строк

,Name,Profession,Degree,Field,Institution,Graduation Year,Country,University Global Ranking,GPA (or Equivalent),Scholarship/Award
110,Thomas Peterffy,Entrepreneur,NaN,NaN,NaN,USA(residence)/ Hungary (origin),NaN,NaN,NaN,NaN
72,Larry Fink,Finance,MBA,Business,UCLA,1976,USA,15,3.9,Academic Excellence

In [451]:
df_succ_edu.tail(3) #вывод 3 последних строк

,Name,Profession,Degree,Field,Institution,Graduation Year,Country,University Global Ranking,GPA (or Equivalent),Scholarship/Award
122,Aliko Dangote,Business,Bachelor's Degree,Business Administration,Al-Azhar University,1977,Nigeria,NaN,NaN,NaN
123,Gennady Timchenko,Business,NaN,NaN,NaN,NaN,Indonesia,NaN,NaN,NaN
124,Idan Ofer,Business,Bachelor's Degree,Economics and Management,London School of Economics,1987,United Kingdom,49,NaN,NaN

In [452]:
df_succ_edu.loc[9:14]
#здесь также возможны варианты df.loc[10:15], df.iloc[10:16] или df.iloc[9:15], если мы хотим именно фактические номера строк

,Name,Profession,Degree,Field,Institution,Graduation Year,Country,University Global Ranking,GPA (or Equivalent),Scholarship/Award
9,Mark Zuckerberg,Entrepreneur,Dropped Out,computer science and psychology,Harvard University,NaN,USA,5,NaN,NaN
10,Marie Curie,Scientist,Doctor of Philosophy,Physics,University of Paris,1903,France,35,NaN,Nobel Fellowship
11,Barack Obama,Politician,Juris Doctor,Law,Harvard Law School,1991,USA,2,3.1,Harvard Law Review Editor
12,Tim Cook,Tech Executive,Master of Business Administration,Business Administration,Fuqua School of Business (Duke University),1988,USA,26,3.8,Fuqua Scholar
13,Serena Williams,Athlete,Bachelor of Science,Business Administration,University of California,2021,USA,40,3.6,Student-Athlete Academic Award
14,Sergey Brin,Entrepreneur,Master of Science,Computer Science,Stanford University,1995,USA,3,3.9,National Science Foundation Fellowship

#### Удалите колонку Scholarship/Award.

In [453]:
df_without_SA = df_succ_edu.drop(columns=['Scholarship/Award']) 

#несколько комментариев
#мне больше нравится работать с копией, потому что уровень тревоги за работу уменьшает возможность в любой момент вернуться к исходнику:)
#в тетрадке приводился еще пример кода 
# df_without_SA = df_succ_edu.drop('Scholarship/Award', axis=1), но способ в моем коде при прочих равных экономичнее, вроде

#### Переименуйте колонку "Profession", заменив на "Occupation".

In [454]:
df_succ_edu.rename(columns={'Profession': 'Occupation'}) #это если мы не хотим сохранять этот результат

df_succ_edu.head(2) #это просто для демонстрации результата сразу

,Name,Profession,Degree,Field,Institution,Graduation Year,Country,University Global Ranking,GPA (or Equivalent),Scholarship/Award
0,Elon Musk,Entrepreneur,Bachelor of Science,Physics & Economics,University of Pennsylvania,1997,USA,13,3.7,Dean’s List
1,Bill Gates,Entrepreneur,Dropped Out,computer science,Harvard University,1975,USA,5,NaN,Dean’s List

In [455]:
df_succ_edu_2 = df_succ_edu.rename(columns={'Profession': 'Occupation'}) #а это если хотим

df_succ_edu_2.head(2)

,Name,Occupation,Degree,Field,Institution,Graduation Year,Country,University Global Ranking,GPA (or Equivalent),Scholarship/Award
0,Elon Musk,Entrepreneur,Bachelor of Science,Physics & Economics,University of Pennsylvania,1997,USA,13,3.7,Dean’s List
1,Bill Gates,Entrepreneur,Dropped Out,computer science,Harvard University,1975,USA,5,NaN,Dean’s List

####  Соберите статистику по столбцу GPA при помощи метода .describe(), не забудьте про NA.

In [456]:
#еще раз считаем, сколько конкретно в этой колонке NA
#убираем NA на всякий случай

df_succ_edu_2['GPA (or Equivalent)'].isna().sum().item() 
#мне кажется, мы не разбирали item, поэтому прокомментирую: он нужен мне, чтобы результат программы был просто числом
#а не шайтанским набором символов np.int64(39), который получается без этого метода

39

In [435]:
df_succ_edu_2['GPA (or Equivalent)'].dropna().describe()

count      86
unique      8
top       3.8
freq       22
Name: GPA (or Equivalent), dtype: object

#### Заполните пропуски в столбце GPA средним значением.

In [436]:
#в 24 строке есть ошибка в данных (GPA записано в странном формате - видимо, это не GPA)

In [528]:
def gpa_to_float(gpa):
    try:
        return float(gpa)
    except (ValueError, TypeError):
        return None

df_succ_edu_2['GPA (or Equivalent)'] = df_succ_edu_2['GPA (or Equivalent)'].apply(gpa_to_float)

In [529]:
df_succ_edu_2.iloc[20:30] #просто посмотрите оно РАБОТАЕТ вы бы просто знали СКОЛЬКО я с ним сидела.

,Name,Occupation,Degree,Field,Institution,Graduation Year,Country,University Global Ranking,GPA (or Equivalent),Scholarship/Award
20,Michelle Obama,Lawyer/Author,PhD,Law,Harvard Law School,1988,USA,2,3.7,Magna Cum Laude
21,Stephen Hawking,Physicist,PhD,Physics,Cambridge University,1966,UK,3,NaN,Nobel Prize Physics
22,J.K. Rowling,Author,Bachelor,French/Classics,University of Exeter,1986,UK,161,NaN,Honorary Degree
23,Morgan Freeman,Actor,None,Drama,Los Angeles City College,NaN,USA,NaN,NaN,Kennedy Center Honor
24,Kamala Harris,Politician,PhD,Law,UC Hastings,1989,USA,62,NaN,Alpha Kappa Alpha
25,Jack Ma,Tech CEO,Bachelor,English,Hangzhou Normal University,1988,China,NaN,3.6,Honorary PhD
26,Marissa Mayer,Tech Executive,Master,Computer Science,Stanford University,1999,USA,4,3.9,National Merit Scholar
27,Neil deGrasse Tyson,Astrophysicist,PhD,Astrophysics,Columbia University,1991,USA,7,3.9,NASA Fellowship
28,Melinda Gates,Philanthropist,MBA,Business,Duke University,1987,USA,23,3.8,Fuqua Scholar
29,Richard Branson,Business Executive,High School,NaN,Stowe School,1968,UK,NaN,NaN,Honorary Degree

In [530]:
gpa_mean = df_succ_edu_2['GPA (or Equivalent)'].mean()
df_succ_edu_2['GPA (or Equivalent)'] = df_succ_edu_2['GPA (or Equivalent)'].fillna(gpa_mean)

In [531]:
df_succ_edu_2['GPA (or Equivalent)'].describe() #любуемся на теперь работающую статистику

count    125.000000
mean       3.771765
std        0.120223
min        3.100000
25%        3.700000
50%        3.771765
75%        3.800000
max        4.000000
Name: GPA (or Equivalent), dtype: float64

## ЧАСТЬ 2: фильтрация и поиск

#### Выведите всех выпускников Лиги плюща (Harvard University, Yale University, Princeton University, Columbia University, Brown University, University of Pennsylvania, Cornell University, Dartmouth College).

In [532]:
ivy_league_uni = ['Harvard University', 'Yale University', 'Princeton University', 'Columbia University', 'Brown University', 'University of Pennsylvania', 'Cornell University', 'Dartmouth College']

df_succ_edu['is_ivy_league'] = df_succ_edu['Institution'].apply(lambda uni: uni in ivy_league_uni)

df_succ_edu[df_succ_edu['is_ivy_league'] == True][['Name', 'Institution']] #такой код выводит просто имена и аффилиации
#df_succ_edu[df_succ_edu['is_ivy_league'] == True] такой бы вывел всю таблицу в нужных рядах

                    Name                 Institution
0              Elon Musk  University of Pennsylvania
1             Bill Gates          Harvard University
4             Jeff Bezos        Princeton University
9        Mark Zuckerberg          Harvard University
18           Emma Watson            Brown University
27   Neil deGrasse Tyson         Columbia University
31              Yo-Yo Ma          Harvard University
33       MacKenzie Scott        Princeton University
43           Andrea Jung        Princeton University
44           John Legend  University of Pennsylvania
45         Anne Wojcicki             Yale University
46        Fareed Zakaria          Harvard University
47          Mindy Kaling           Dartmouth College
57       Natalie Portman          Harvard University
58        Warren Buffett         Columbia University
61         Steve Ballmer          Harvard University
63     Michael Bloomberg          Harvard University
73    Stephen Schwarzman          Harvard University
75         Len Blavatnik         Columbia University
102          Ken Griffin          Harvard University
103      Eduardo Saverin          Harvard University
121       Daniel Gilbert             Yale University

#### Найдите всех нобелевских лауреатов и выведите только их имена, страну и род деятельности.

In [353]:
import re

df_succ_edu_2['nobel'] = df_succ_edu_2['Scholarship/Award'].str.contains(r'Nobel .*Prize', na=False)
df_succ_edu_2[df_succ_edu_2['nobel'] == True][['Name', 'Country', 'Occupation']]

#оно не ищет нобел феллоушип и кмк это хорошо; но если что, можно просто из стр контейнс убрать регулярки и оставить 'Nobel'

                Name Country Occupation
8   Malala Yousafzai      UK   Activist
21   Stephen Hawking      UK  Physicist

## ЧАСТЬ 3: создание и преобразование столбцов

#### Создайте колонку 'Top_University' со значением True для университетов, входящих в топ-50. Обратите внимание на значения типа "231–240".

#### Создайте колонку Academic_Performance, в которую внесите значение:
#### - "High", если GPA выше 3.5 баллов,
#### - "Medium", если GPA от 3 до 3.49 баллов,
#### - "Low", если GPA ниже 3 баллов.

#### Посмотрите на уникальные значения в колонке Degree и приведите их к единообразию (Bachelor of Science -> Bachelor).

In [536]:
df_succ_edu_2['GPA (or Equivalent)'] = pd.to_numeric(df_succ_edu_2['GPA (or Equivalent)'])
def academic_performance(gpa):
    if isinstance(gpa, float):
        if gpa > 3.5:
            perf = 'High'
        elif gpa >= 3:
            perf = 'Medium'
        elif gpa < 3:
            perf = 'Low'
        return perf
    return None

df_succ_edu_2['Academic_Performance'] = df_succ_edu_2['GPA (or Equivalent)'].apply(academic_performance)
df_succ_edu_2.head(15)

,Name,Occupation,Degree,Field,Institution,Graduation Year,Country,University Global Ranking,GPA (or Equivalent),Scholarship/Award,Academic_Performance
0,Elon Musk,Entrepreneur,Bachelor,Physics & Economics,University of Pennsylvania,1997,USA,13,3.700000,Dean’s List,High
1,Bill Gates,Entrepreneur,Dropped Out,computer science,Harvard University,1975,USA,5,3.771765,Dean’s List,High
2,Sundar Pichai,Tech Executive,Master,Material Sciences and Engineering,Stanford University,1995,USA,3,3.800000,Fellowship in Engineering,High
3,Sheryl Sandberg,Tech Executive,MBA,Business Administration,Harvard Business School,1995,USA,2,3.900000,Hoover Fellowship,High
4,Jeff Bezos,Entrepreneur,Bachelor,Computer Science and Electrical Engineering,Princeton University,1986,USA,16,3.600000,Marquis Scholar,High
5,Indra Nooyi,Business Leader,MBA,Management,Yale School of Management,1980,USA,11,3.700000,Scholarship Winner,High
6,Oprah Winfrey,Media Executive,PhD,speech communications and performing arts,Tennessee State University,1987,USA,NaN,3.771765,Honorary Award,High
7,Satya Nadella,Tech Executive,Master,Computer Science,University of Wisconsin–Milwaukee,1990,USA,301–350,3.500000,Academic Excellence Award,Medium
8,Malala Yousafzai,Activist,Undergraduate Studies,Philosophy,University of Oxford,2021,UK,4,3.771765,Nobel Peace Prize,High
9,Mark Zuckerberg,Entrepreneur,Dropped Out,computer science and psychology,Harvard University,NaN,USA,5,3.771765,NaN,High
10,Marie Curie,Scientist,PhD,Physics,University of Paris,1903,France,35,3.771765,Nobel Fellowship,High
11,Barack Obama,Politician,PhD,Law,Harvard Law School,1991,USA,2,3.100000,Harvard Law Review Editor,Medium
12,Tim Cook,Tech Executive,MBA,Business Administration,Fuqua School of Business (Duke University),1988,USA,26,3.800000,Fuqua Scholar,High
13,Serena Williams,Athlete,Bachelor,Business Administration,University of California,2021,USA,40,3.600000,Student-Athlete Academic Award,High
14,Sergey Brin,Entrepreneur,Master,Computer Science,Stanford University,1995,USA,3,3.900000,National Science Foundation Fellowship,High

In [474]:
df_succ_edu_2['Degree'].unique()

array(['Bachelor of Science', 'Dropped Out', 'Master of Science',
       'Master of Business Administration', 'Honorary Doctorate',
       'Undergraduate Studies', 'Doctor of Philosophy', 'Juris Doctor',
       'Master of Arts', 'Bachelor of Arts', 'High School', 'PhD',
       'Bachelor', nan, 'Master', 'MBA', 'Master/MBA', 'MD', 'Dropout',
       'Engineering', 'No Degree', 'MBA and BA', 'Specialist Degree',
       'Ph.D.', "Bachelor's Degree"], dtype=object)

In [481]:
#мне не нравится адхоковость этого способа, но на большее я не способна:(

def universal_degree(degree):
    if isinstance(degree, str):
        if 'MD' in degree:
            degree_modified = 'Master'
        elif 'MBA' in degree:
            degree_modified = 'MBA' #ее обычно отдельно выносят, как отдельный вид степени
        elif 'Master' in degree:
            if 'Business' in degree:
                degree_modified = 'MBA'
            else:
                degree_modified = 'Master'
        elif 'Bachelor' in degree:
            degree_modified = 'Bachelor'
        elif 'PhD' in degree or 'Doctor' in degree or 'Ph.D' in degree:
            degree_modified = 'PhD' #обычно пишут так; honorary doctorate я не поняла что такое, пусть оно туда попадает
        else:
            degree_modified = degree
        return degree_modified
    return None

#Undergraduate Studies идейно должно быть в разделе бакалавриата, но чето я засомневалась, пусть будет отдельно

df_succ_edu_2['Degree'] = df_succ_edu_2['Degree'].apply(universal_degree)

## ЧАСТЬ 4: агрегация и группировка

#### Найдите топ-5 университетов по количеству выпускников в датасете.

In [516]:
df_succ_edu_2.groupby(by='Institution').size().sort_values(ascending=False).head(5)

Institution
Harvard University          10
Stanford University          9
UCLA                         4
Princeton University         3
University of California     3
dtype: int64

#### Найдите топ-5 самых популярных областей обучения среди предпринимателей.

In [519]:
df_succ_edu_2[df_succ_edu_2['Occupation'] == 'Entrepreneur'].groupby('Field').size().sort_values(ascending=False).head(5)

#если бы мы работали с реальными данными, конечно, нужно было бы взять еще всяких businessmen в occupation, но у меня полчаса до дедлайна
#и мигрень, а вообще - можно было бы сделать быструю функцию, которая объединяля бы данные для разного business

#потому что пока выводы странные: получается, что бОльшая часть предпринимателей (!) получали образование в области инжнеерии / айти

Field
Computer Science    9
Engineering         6
Business            3
Economics           2
Biology             1
dtype: int64

#### Определите топ-5 стран с самыми высокими значениями GPA.

In [534]:
df_succ_edu_2.groupby('Country').agg({'GPA (or Equivalent)': 'mean'}).sort_values('GPA (or Equivalent)', ascending=False).head(5)

#здесь нужен какой-то метод анализа данных с применением матстата, потому что здесь есть хорошо показывающая проблему погрешность в виде мексики: 
#из всех строк таблицы мексика есть в трех, и во всех трех gpa 3.8; это, конечно, не значит, что мексика - столица мирового образования)

             GPA (or Equivalent)
Country
Switzerland             4.000000
Austria                 3.800000
Mexico                  3.800000
France                  3.788706
USA                     3.779517

#### Сгруппируйте записи по профессиям и посчитайте:
#### - количество людей в каждой профессии,
#### - средний GPA для каждой профессии,
#### - количество людей с разными уровнями образования для каждой профессии.

#### Сгруппируйте данные сначала по стране и профессии. Посчитайте:
#### - количество людей,
#### - средний GPA.

#### Удалите NA в столбце с годом выпуска, преобразуйте значения в тип datetime64, сделайте столбец индексом датафрейма и сгруппируйте по десятилетиям (метод .resample). Посчитайте:
#### - количество выпускников в каждом десятилетии,
#### - наиболее популярную область обучения для каждого десятилетия,
#### - средний GPA.
#### PS: сначала избавьтесь от NA в соответствующей колонке.